[
  {
    "id": "v0_000001",
    "task": "bullet_rewrite",
    "role_target": "Data Analyst",
    "seniority": "Graduate",
    "industry": "General",
    "input": {
      "cv_text": "SUMMARY: Graduate with interest in data analysis.\nEXPERIENCE BULLETS:\n- Made weekly reports.\n- Cleaned data.\n- Helped the team with dashboards.\nSKILLS: Excel, SQL, Power BI, Python",
      "job_description": "",
      "constraints": {
        "no_hallucination": true,
        "uk_spelling": true,
        "min_bullets": 4,
        "max_bullets": 6,
        "must_not_add_tools": true,
        "must_not_add_metrics": true
      }
    },
    "output": {
      "optimized_summary": "Graduate-level data analyst profile with experience supporting reporting, improving data consistency, and updating dashboards using Excel, SQL, Power BI, and Python.",
      "optimized_bullets": [
        "Produced weekly reports by preparing and organising data for clear team updates.",
        "Cleaned and validated datasets to improve consistency before reporting and dashboard updates.",
        "Supported dashboard updates by maintaining inputs and checking outputs for accuracy.",
        "Clarified reporting needs with the team to keep recurring outputs consistent and easy to review."
      ],
      "keywords_used": [
        "Excel",
        "SQL",
        "Power BI",
        "Python",
        "reporting",
        "dashboards"
      ],
      "warnings": [
        "Consider adding examples of what the weekly reports covered (e.g., operational updates, performance tracking).",
        "If available, include outcomes such as improved turnaround time or fewer corrections (without inventing numbers)."
      ]
    }
  },
  {
    "id": "v0_000002",
    "task": "jd_match",
    "role_target": "Data Analyst",
    "seniority": "Graduate",
    "industry": "General",
    "input": {
      "cv_text": "SUMMARY: MSc graduate with experience in data reporting.\nEXPERIENCE BULLETS:\n- Used SQL to pull data for reports.\n- Built Excel trackers.\n- Created charts for weekly updates.\nSKILLS: SQL, Excel, Power BI",
      "job_description": "Looking for a Data Analyst with SQL querying, KPI reporting, dashboarding (Power BI), and strong communication with stakeholders.",
      "constraints": {
        "no_hallucination": true,
        "uk_spelling": true,
        "min_bullets": 4,
        "max_bullets": 6,
        "must_not_add_tools": true,
        "must_not_add_metrics": true
      }
    },
    "output": {
      "optimized_summary": "Data analyst profile with experience using SQL, Excel, and Power BI to support reporting workflows and deliver clear weekly updates through charts and dashboards.",
      "optimized_bullets": [
        "Used SQL to extract reporting datasets and prepare them for regular updates.",
        "Built and maintained Excel trackers to organise reporting inputs and support consistent delivery.",
        "Created charts for weekly updates to communicate trends and changes clearly.",
        "Supported Power BI dashboards to improve visibility of recurring reporting outputs.",
        "Shared weekly reporting updates in a clear format to support follow-up actions."
      ],
      "keywords_used": [
        "SQL",
        "Power BI",
        "dashboards"
      ],
      "warnings": [
        "The job description mentions KPI reporting—only use KPI language if your reports genuinely tracked KPIs; otherwise keep it as weekly reporting/updates.",
        "If you have examples of who you reported to (e.g., managers/teams), add that detail to support the stakeholder requirement."
      ]
    }
  },
  {
    "id": "v0_000003",
    "task": "ats_optimize",
    "role_target": "Data Analyst",
    "seniority": "Graduate",
    "industry": "General",
    "input": {
      "cv_text": "SUMMARY: Data-focused graduate.\nEXPERIENCE BULLETS:\n- Cleaned datasets and updated reports.\n- Worked with Excel and SQL.\n- Made Power BI visuals.\nSKILLS: Excel, SQL, Power BI",
      "job_description": "Data Analyst: data cleaning, SQL querying, dashboard reporting, KPI tracking, and data quality checks.",
      "constraints": {
        "no_hallucination": true,
        "uk_spelling": true,
        "min_bullets": 3,
        "max_bullets": 5,
        "must_not_add_tools": true,
        "must_not_add_metrics": true
      }
    },
    "output": {
      "optimized_summary": "Data analyst profile with experience in data cleaning, SQL querying, and dashboard reporting using Excel and Power BI to support reliable reporting outputs.",
      "optimized_bullets": [
        "Performed data cleaning and basic data quality checks to improve consistency before reporting.",
        "Used SQL querying to prepare datasets for report updates and analysis tasks.",
        "Updated Excel-based reports to keep recurring reporting outputs accurate and organised.",
        "Built Power BI visuals to support dashboard reporting and present trends clearly."
      ],
      "keywords_used": [
        "data cleaning",
        "SQL querying",
        "dashboard reporting",
        "data quality checks",
        "Power BI"
      ],
      "warnings": [
        "KPI tracking appears in the job description—only include it if it is true for your experience; otherwise avoid claiming KPI tracking."
      ]
    }
  },
  {
    "id": "v0_000004",
    "task": "bullet_rewrite",
    "role_target": "Data Analyst",
    "seniority": "Graduate",
    "industry": "General",
    "input": {
      "cv_text": "SUMMARY: Graduate interested in analytics.\nEXPERIENCE BULLETS:\n- Improved data.\n- Made dashboards.\n- Worked with people.\nSKILLS: Power BI, Excel",
      "job_description": "",
      "constraints": {
        "no_hallucination": true,
        "uk_spelling": true,
        "min_bullets": 3,
        "max_bullets": 5,
        "must_not_add_tools": true,
        "must_not_add_metrics": true,
        "forbidden_tools": [
          "SQL",
          "Python"
        ]
      }
    },
    "output": {
      "optimized_summary": "Entry-level analyst profile with experience using Excel and Power BI to improve data organisation, maintain dashboards, and support clear reporting updates.",
      "optimized_bullets": [
        "Improved data organisation by reviewing inputs and correcting basic inconsistencies before reporting.",
        "Created and updated Power BI dashboards to present information clearly and consistently.",
        "Maintained Excel files used for reporting and dashboard source data.",
        "Collaborated with team members to clarify dashboard and reporting needs and align outputs to expectations."
      ],
      "keywords_used": [
        "Excel",
        "Power BI",
        "dashboards",
        "reporting"
      ],
      "warnings": [
        "Metrics are missing—if available, add outcomes such as improved accuracy or reduced manual effort (without inventing numbers).",
        "If you used specific data sources (spreadsheets, exports, internal systems), add them to improve specificity."
      ]
    }
  },
  {
    "id": "v0_000005",
    "task": "jd_match",
    "role_target": "Data Analyst",
    "seniority": "Graduate",
    "industry": "General",
    "input": {
      "cv_text": "SUMMARY: Graduate with experience supporting reporting tasks.\nEXPERIENCE BULLETS:\n- Prepared monthly reports using Excel.\n- Checked data for errors.\n- Shared updates with the team.\nSKILLS: Excel, Power BI, Communication",
      "job_description": "Data Analyst role focusing on monthly KPI reporting, dashboard maintenance (Power BI), and communicating insights to non-technical stakeholders.",
      "constraints": {
        "no_hallucination": true,
        "uk_spelling": true,
        "min_bullets": 4,
        "max_bullets": 4,
        "must_not_add_tools": true,
        "must_not_add_metrics": true
      }
    },
    "output": {
      "optimized_summary": "Data analyst profile with experience preparing monthly reports in Excel, performing data checks for accuracy, and supporting Power BI dashboard maintenance with clear communication for non-technical audiences.",
      "optimized_bullets": [
        "Prepared monthly reports in Excel to support regular performance updates for the team.",
        "Performed data checks to identify errors and improve accuracy before reports were shared.",
        "Supported Power BI dashboard maintenance by keeping reporting views consistent and up to date.",
        "Communicated monthly updates in a clear format for non-technical team members."
      ],
      "keywords_used": [
        "dashboard maintenance",
        "Power BI",
        "communicating insights"
      ],
      "warnings": [
        "The job description mentions KPI reporting—only include KPI language if your monthly reports genuinely tracked KPIs; otherwise keep it as monthly reporting."
      ]
    }
  },
  {
    "id": "v0_000006",
    "task": "jd_match",
    "role_target": "Data Analyst",
    "seniority": "Graduate",
    "industry": "General",
    "input": {
      "cv_text": "SUMMARY: Graduate with SQL and Excel experience.\nEXPERIENCE BULLETS:\n- Wrote SQL queries for data.\n- Updated Excel reports.\n- Supported data requests.\nSKILLS: SQL, Excel",
      "job_description": "Data Analyst: strong SQL (joins, aggregations), ad-hoc analysis, reporting, and data validation.",
      "constraints": {
        "no_hallucination": true,
        "uk_spelling": true,
        "min_bullets": 4,
        "max_bullets": 6,
        "must_not_add_tools": true,
        "must_not_add_metrics": true,
        "forbidden_tools": [
          "Power BI",
          "Python"
        ]
      }
    },
    "output": {
      "optimized_summary": "Data analyst profile with experience using SQL and Excel to support reporting outputs, respond to ad-hoc data requests, and improve reliability through basic data validation checks.",
      "optimized_bullets": [
        "Wrote SQL queries to extract and prepare datasets for reporting and analysis needs.",
        "Supported ad-hoc analysis requests by retrieving relevant data and presenting results clearly.",
        "Updated Excel reports to keep recurring reporting outputs consistent and organised.",
        "Performed basic data validation checks to identify missing or inconsistent values before sharing outputs.",
        "Organised query outputs and reporting files to support repeatable workflows."
      ],
      "keywords_used": [
        "ad-hoc analysis",
        "reporting",
        "data validation"
      ],
      "warnings": [
        "The job description mentions joins and aggregations—if you genuinely used them, add a brief, truthful example; otherwise do not claim them."
      ]
    }
  },
  {
    "id": "v0_000007",
    "task": "bullet_rewrite",
    "role_target": "Data Analyst",
    "seniority": "Graduate",
    "industry": "General",
    "input": {
      "cv_text": "SUMMARY: Analyst with reporting experience.\nEXPERIENCE BULLETS:\n- Sent weekly reports.\n- Made improvements to reporting.\n- Worked with stakeholders.\nSKILLS: Excel, PowerPoint, SQL",
      "job_description": "",
      "constraints": {
        "no_hallucination": true,
        "uk_spelling": true,
        "min_bullets": 4,
        "max_bullets": 4,
        "must_not_add_tools": true,
        "must_not_add_metrics": true
      }
    },
    "output": {
      "optimized_summary": "Data analyst profile with experience delivering weekly reporting using SQL and Excel, improving report consistency, and working with stakeholders to align outputs to business needs.",
      "optimized_bullets": [
        "Delivered weekly reports using SQL and Excel to provide regular updates on key information.",
        "Improved reporting consistency by refining report structure and standardising recurring outputs.",
        "Worked with stakeholders to gather reporting requirements and confirm what information was needed.",
        "Presented weekly updates using PowerPoint to communicate findings clearly in a business-friendly format."
      ],
      "keywords_used": [
        "SQL",
        "Excel",
        "PowerPoint",
        "weekly reporting",
        "stakeholders"
      ],
      "warnings": [
        "If you can, add what changed after your reporting improvements (e.g., clearer format, fewer corrections, faster turnaround) without inventing numbers."
      ]
    }
  },
  {
    "id": "v0_000008",
    "task": "jd_match",
    "role_target": "Data Analyst",
    "seniority": "Graduate",
    "industry": "General",
    "input": {
      "cv_text": "SUMMARY: Graduate with dashboard experience.\nEXPERIENCE BULLETS:\n- Built Power BI dashboards.\n- Updated data in dashboards.\n- Made reports for the team.\nSKILLS: Power BI, Excel",
      "job_description": "Data Analyst role: dashboard development, KPI visualization, data refresh processes, and clear reporting to stakeholders.",
      "constraints": {
        "no_hallucination": true,
        "uk_spelling": true,
        "min_bullets": 4,
        "max_bullets": 5,
        "must_not_add_tools": true,
        "must_not_add_metrics": true,
        "forbidden_tools": [
          "SQL",
          "Python"
        ]
      }
    },
    "output": {
      "optimized_summary": "Data analyst profile with hands-on experience in dashboard development using Power BI, plus clear reporting updates supported by Excel.",
      "optimized_bullets": [
        "Supported dashboard development in Power BI by building reporting views for regular updates.",
        "Maintained dashboards by updating underlying data inputs and checking outputs for consistency.",
        "Produced team reports in a clear format to support routine updates and decision-making.",
        "Aligned dashboard content with stakeholder needs by collecting feedback and refining reporting views."
      ],
      "keywords_used": [
        "dashboard development",
        "stakeholders"
      ],
      "warnings": [
        "The job description mentions data refresh processes—if you handled refresh steps (manual updates or scheduled refresh), add a truthful description without guessing.",
        "KPI visualisation is mentioned—only use KPI language if it reflects your actual dashboard content."
      ]
    }
  },
  {
    "id": "v0_000009",
    "task": "ats_optimize",
    "role_target": "Data Analyst",
    "seniority": "Graduate",
    "industry": "General",
    "input": {
      "cv_text": "SUMMARY: Graduate.\nEXPERIENCE BULLETS:\n- Did data analysis.\n- Worked on reports.\nSKILLS: Excel",
      "job_description": "Data Analyst: reporting, data cleaning, KPI tracking, and communicating insights.",
      "constraints": {
        "no_hallucination": true,
        "uk_spelling": true,
        "min_bullets": 3,
        "max_bullets": 3,
        "must_not_add_tools": true,
        "must_not_add_metrics": true
      }
    },
    "output": {
      "optimized_summary": "Entry-level data analyst profile with experience supporting Excel-based reporting and basic analysis tasks in a team environment.",
      "optimized_bullets": [
        "Supported Excel-based reporting by organising data and preparing simple analysis outputs.",
        "Assisted with report updates to help the team review key information consistently.",
        "Communicated progress and reporting needs clearly within the team."
      ],
      "keywords_used": [
        "reporting"
      ],
      "warnings": [
        "Your CV is very high-level—add details on what data you analysed and what the reports were used for.",
        "The job description mentions data cleaning and KPI tracking—only include these if you have real examples; otherwise do not claim them."
      ]
    }
  },
  {
    "id": "v0_000010",
    "task": "jd_match",
    "role_target": "Junior Data Analyst",
    "seniority": "Graduate",
    "industry": "General",
    "input": {
      "cv_text": "SUMMARY: Graduate with experience in reporting and data checks.\nEXPERIENCE BULLETS:\n- Checked data files for mistakes.\n- Updated weekly Excel reports.\n- Shared results with the team.\nSKILLS: Excel, SQL",
      "job_description": "Junior Data Analyst: data quality checks, SQL data extraction, weekly reporting, and communicating insights.",
      "constraints": {
        "no_hallucination": true,
        "uk_spelling": true,
        "min_bullets": 4,
        "max_bullets": 4,
        "must_not_add_tools": true,
        "must_not_add_metrics": true
      }
    },
    "output": {
      "optimized_summary": "Junior data analyst profile with experience performing data quality checks and communicating insights from weekly reporting using Excel and SQL.",
      "optimized_bullets": [
        "Performed data quality checks by reviewing files for missing or inconsistent values before reporting.",
        "Handled SQL data extraction by pulling the information needed for weekly updates.",
        "Updated weekly Excel reports to ensure consistent delivery of key information.",
        "Shared results clearly with the team, communicating insights in an easy-to-understand format."
      ],
      "keywords_used": [
        "data quality checks",
        "SQL data extraction",
        "weekly reporting",
        "communicating insights"
      ],
      "warnings": [
        "If possible, add what the weekly reports tracked (e.g., operational updates, performance measures) without inventing details."
      ]
    }
  }
]
